# ExportToPCF Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationUtils..::..ExportToPCF Method
FabricationUtils Class See Also
---
Exports a list of fabrication parts into PCF format.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static void ExportToPCF(
	Document document,
	IList<ElementId> ids,
	string filename
)
```

Visual Basic
---
```text
Public Shared Sub ExportToPCF ( _
	document As Document, _
	ids As IList(Of ElementId), _
	filename As String _
)
```

Visual C++
---
```text
public:
static void ExportToPCF(
	Document^ document,
	IList<ElementId^>^ ids,
	String^ filename
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
ids
    Type: System.Collections.Generic..::..IList<(Of <(<'ElementId>)>)> An array of FabricationPart element identifiers. Non-fabrication parts are ignored.
filename
    Type: System..::..String The name given to the output file.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Fabrication configuration is missing. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationUtils Class
Autodesk.Revit.DB.Fabrication Namespace